Repository: abuamar142/mobile-londri
Catalog: lib/config/i18n/app_*.arb
Languages: id

# splash_screen_text
source: Manage your Laundry Business Easily
id: Kelola Bisnis Laundry Anda dengan Mudah

# auth_login_screen_title
source: Login
id: Masuk

# auth_login_screen_text_title
source: Welcome to Londri Application
id: Selamat Datang di Aplikasi Londri

# auth_login_screen_text_subtitle
source: Please login to continue
id: Silakan masuk untuk melanjutkan

# auth_login_screen_rich_text_text
source: Don't have an account?
id: Belum punya akun?

# auth_login_screen_rich_text_button
source: Register here
id: Daftar di sini

# auth_login_error_message
source: Login failed, please check your email and password
id: Gagal masuk, silakan periksa email dan kata sandi Anda

# auth_login_error_email_not_confirmed
source: Email not confirmed, please check your email
id: Email Anda belum terkonfirmasi, silakan periksa email Anda

# auth_login_success_message
source: Login successful
id: Berhasil masuk

# auth_register_screen_title
source: Register
id: Daftar

# auth_register_screen_text_title
source: Create an Account
id: Buat Akun Baru

# auth_register_screen_text_subtitle
source: Please fill in the form to create an account
id: Silakan isi kolom di bawah ini untuk mendaftar

# auth_register_screen_rich_text_text
source: Already have an account?
id: Sudah punya akun?

# auth_register_screen_rich_text_button
source: Login here
id: Masuk di sini

# auth_register_success_message
source: Register successful, please check your email to confirm
id: Berhasil mendaftar, silakan periksa email Anda untuk mengonfirmasi akun Anda

# auth_logout_success_message
source: Logout successful
id: Berhasil keluar

# manage_staff_screen_title
source: Manage Staff
id: Kelola Pegawai

# manage_staff_empty_message
source: No staff found
id: Tidak ada pegawai ditemukan

# manage_staff_search_hint
source: Search name or email
id: Cari nama atau email

# manage_staff_activate_staff
source: Activate Staff
id: Aktifkan Pegawai

# manage_staff_deactivate_staff
source: Deactivate Staff
id: Nonaktifkan Pegawai

# manage_staff_activate_dialog_confirm_message
source: Are you sure you want to activate {staffName}?
id: Apakah Anda yakin ingin mengaktifkan {staffName}?

# manage_staff_deactivate_dialog_confirm_message
source: Are you sure you want to deactivate {staffName}?
id: Apakah Anda yakin ingin menonaktifkan {staffName}?

# manage_staff_success_activate_message
source: Success activated {staffName}
id: Berhasil mengaktifkan {staffName}

# manage_staff_success_deactivate_message
source: Success deactivated {staffName}
id: Berhasil menonaktifkan {staffName}

# manage_staff_active_tap_info
source: {staffName} is Staff, long press to deactivate
id: {staffName} adalah Pegawai, tekan lama untuk menonaktifkan

# manage_staff_non_active_tap_info
source: {staffName} is Non Active Staff, long press to activate
id: {staffName} adalah User biasa, tekan lama untuk mengaktifkan sebagai Pegawai

# service_screen_title
source: Services
id: Layanan

# service_search_hint
source: Search name or description
id: Cari nama atau deskripsi

# service_empty_message
source: No services found
id: Tidak ada layanan ditemukan

# service_add_screen_title
source: Add Service
id: Tambah Layanan

# service_edit_screen_title
source: Edit Service
id: Edit Layanan

# service_view_screen_title
source: Service Details
id: Detail Layanan

# service_deactivate_dialog_title
source: Deactivate Service
id: Nonaktifkan Layanan

# service_activate_dialog_title
source: Activate Service
id: Aktifkan Layanan

# service_hard_delete_dialog_title
source: Hard Delete Service
id: Hapus Permanen Layanan

# service_ask_super_admin_to_activate
source: Please contact super admin to activate this service
id: Silakan hubungi super admin untuk mengaktifkan layanan ini

# service_add_success_message
source: Service added successfully
id: Layanan berhasil ditambahkan

# service_update_success_message
source: Service updated successfully
id: Layanan berhasil diperbarui

# service_deactivate_success_message
source: Service deactivated successfully
id: Layanan berhasil dinonaktifkan

# service_activate_success_message
source: Service activated successfully
id: Layanan berhasil diaktifkan

# service_hard_delete_success_message
source: Service deleted permanently
id: Layanan berhasil dihapus secara permanen

# service_deactivate_confirm_message
source: Are you sure you want to deactivate {serviceName}?
id: Apakah Anda yakin ingin menonaktifkan layanan {serviceName}?

# service_activate_confirm_message
source: Are you sure you want to activate {serviceName}?
id: Apakah Anda yakin ingin mengaktifkan layanan {serviceName}?

# service_hard_delete_confirm_message
source: Are you sure you want to delete {serviceName} permanently?
id: Apakah Anda yakin ingin menghapus layanan {serviceName} secara permanen?

# service_info_activate
source: Long press to activate this service
id: Tekan lama untuk mengaktifkan layanan

# service_info_active
source: This service is active
id: Layanan ini sudah aktif

# service_information_card_label
source: Information
id: Informasi

# service_description_card_label
source: Description
id: Deskripsi

# transaction_screen_title
source: Transaction
id: Transaksi

# transaction_screen_tab_inactive
source: Inactive
id: Tidak Aktif

# transaction_screen_tab_active
source: Active
id: Aktif

# transaction_screen_tab_all
source: All
id: Semua

# transaction_screen_tab_on_progress
source: On Progress
id: Sedang Diproses

# transaction_screen_tab_ready_for_pickup
source: Ready for Pickup
id: Siap Diambil

# transaction_screen_tab_picked_up
source: Picked Up
id: Sudah Diambil

# transaction_search_hint
source: Search transaction
id: Cari transaksi

# transaction_deleted_message
source: Transaction deleted, long press to restore
id: Transaksi sudah dihapus, tekan lama untuk mengembalikan

# transaction_empty_message
source: No transaction found
id: Tidak ada transaksi ditemukan

# transaction_empty_inactive_message
source: No inactive transaction found
id: Tidak ada transaksi tidak aktif ditemukan

# transaction_empty_active_message
source: No active transaction found
id: Tidak ada transaksi aktif ditemukan

# transaction_empty_on_progress_message
source: No transaction in progress found
id: Tidak ada transaksi sedang diproses ditemukan

# transaction_empty_ready_for_pickup_message
source: No transaction ready for pickup found
id: Tidak ada transaksi siap diambil ditemukan

# transaction_empty_picked_up_message
source: No transaction picked up found
id: Tidak ada transaksi sudah diambil ditemukan

# transaction_add_screen_title
source: Add Transaction
id: Tambah Transaksi

# transaction_edit_screen_title
source: Edit Transaction
id: Edit Transaksi

# transaction_detail_screen_title
source: Transaction Details
id: Detail Transaksi

# transaction_delete_dialog_title
source: Delete Transaction
id: Hapus Transaksi

# transaction_add_success_message
source: Transaction added successfully
id: Transaksi berhasil ditambahkan

# transaction_update_success_message
source: Transaction updated successfully
id: Transaksi berhasil diperbarui

# transaction_delete_success_message
source: Transaction deleted successfully
id: Transaksi berhasil dihapus

# transaction_restore_success_message
source: Transaction restored successfully
id: Transaksi berhasil dipulihkan

# transaction_delete_confirm_message
source: Are you sure you want to delete {transactionId}?
id: Apakah Anda yakin ingin menghapus transaksi {transactionId}?

# transaction_hard_delete_confirm_message
source: Are you sure you want to delete {transactionId} permanently?
id: Apakah Anda yakin ingin menghapus transaksi {transactionId} secara permanen?

# transaction_restore_dialog_title
source: Restore Transaction
id: Pulihkan Transaksi

# transaction_restore_confirm_message
source: Are you sure to restore transaction {transactionId}?
id: Apakah Anda yakin ingin memulihkan transaksi {transactionId}?

# transaction_add_failed_message
source: Failed to add transaction
id: Gagal menambahkan transaksi

# transaction_edit_failed_message
source: Failed to update transaction
id: Gagal memperbarui transaksi

# transaction_delete_failed_message
source: Failed to delete transaction
id: Gagal menghapus transaksi

# transaction_item_service_label
source: Service: {serviceName}
id: Layanan : {serviceName}

# transaction_item_weight_label
source: Weight: {weight} Kg
id: Berat : {weight} Kg

# transaction_item_amount_label
source: Amount: {amount}
id: Total : {amount}

# transaction_item_start_date_label
source: Start : {startDate}
id: Mulai : {startDate}

# transaction_item_end_date_label
source: End : {endDate}
id: Selesai : {endDate}

# transaction_item_empty_customer_name
source: Customer not found
id: Pelanggan tidak ditemukan

# transaction_item_empty_service_name
source: Service not found
id: Layanan tidak ditemukan

# transaction_status_ready_for_pickup
source: Ready for Pickup
id: Siap Diambil

# transaction_status_picked_up
source: Picked Up
id: Sudah Diambil

# customer_screen_title
source: Customer
id: Pelanggan

# customer_search_hint
source: Search name, phone, or description
id: Cari nama, telepon, atau deskripsi

# customer_empty_message
source: No customer found
id: Tidak ada pelanggan ditemukan

# customer_view_dialog_title
source: Customer Details
id: Detail Pelanggan

# customer_add_dialog_title
source: Add Customer
id: Tambah Pelanggan

# customer_edit_dialog_title
source: Edit Customer
id: Edit Pelanggan

# customer_activate_dialog_title
source: Activate Customer
id: Aktifkan Pelanggan

# customer_deactivate_dialog_title
source: Deactivate Customer
id: Nonaktifkan Pelanggan

# customer_hard_delete_dialog_title
source: Hard Delete Customer
id: Hapus Permanen Pelanggan

# customer_add_success_message
source: Customer added successfully
id: Pelanggan berhasil ditambahkan

# customer_update_success_message
source: Customer updated successfully
id: Pelanggan berhasil diperbarui

# customer_activate_success_message
source: Customer activated successfully
id: Pelanggan berhasil diaktifkan

# customer_deactivate_success_message
source: Customer deactivated successfully
id: Pelanggan berhasil dinonaktifkan

# customer_hard_delete_success_message
source: Customer deleted permanently
id: Pelanggan berhasil dihapus secara permanen

# customer_activate_confirm_message
source: Are you sure you want to activate {customerName}?
id: Apakah Anda yakin ingin mengaktifkan pelanggan {customerName}?

# customer_deactivate_confirm_message
source: Are you sure you want to deactivate {customerName}?
id: Apakah Anda yakin ingin menonaktifkan pelanggan {customerName}?

# customer_hard_delete_confirm_message
source: Are you sure you want to delete {customerName} permanently?
id: Apakah Anda yakin ingin menghapus pelanggan {customerName} secara permanen?

# customer_add_failed_message
source: Failed to add customer
id: Gagal menambahkan pelanggan

# customer_edit_failed_message
source: Failed to update customer
id: Gagal memperbarui pelanggan

# customer_delete_failed_message
source: Failed to delete customer
id: Gagal menghapus pelanggan

# customer_info_activate
source: Long press to activate
id: Tekan lama untuk mengaktifkan pelanggan

# customer_info_non_active
source: This customer is not active
id: Pelanggan ini tidak aktif

# customer_info_active
source: This customer is active
id: Pelanggan ini sudah aktif

# customer_information_card_label
source: Information
id: Informasi

# customer_invoice_card_label
source: Invoice
id: Catatan

# customer_transaction_card_label
source: Transaction
id: Transaksi

# customer_redirect_to_transaction_screen
source: See Transaction
id: Lihat Transaksi

# customer_send_whatsapp_message
source: Send WhatsApp message
id: Kirim pesan WhatsApp

# locale_change_success_message
source: Language changed successfully
id: Bahasa berhasil diubah

# home_screen_title
source: Home
id: Beranda

# setting_screen_title
source: Setting
id: Pengaturan

# setting_language_label
source: Language
id: Bahasa

# setting_language_en
source: English
id: Bahasa Inggris

# setting_language_id
source: Indonesian
id: Bahasa Indonesia

# error_occurred_message
source: An error occurred
id: Terjadi kesalahan

# sort_text
source: Sort
id: Urutkan

# sort_asc
source: Ascending
id: Naik

# sort_desc
source: Descending
id: Turun

# sort_by_name
source: Name
id: Nama

# sort_by_price
source: Price
id: Harga

# sort_by_role
source: Role
id: Peran

# sort_by_created_at
source: Created At
id: Tanggal Dibuat

# sort_by_customer_name
source: Customer Name
id: Nama Pelanggan

# sort_by_service_name
source: Service Name
id: Nama Layanan

# sort_by_amount
source: Amount
id: Jumlah

# sort_by_payment_status
source: Payment Status
id: Status Pembayaran

# sort_by_start_date
source: Start Date
id: Tanggal Mulai

# sort_by_end_date
source: End Date
id: Tanggal Selesai

# form_name_label
source: Name
id: Nama

# form_password_label
source: Password
id: Kata Sandi

# form_confirm_password_label
source: Confirm Password
id: Konfirmasi Kata Sandi

# form_phone_label
source: Phone
id: Telepon

# form_description_label
source: Description
id: Deskripsi

# form_price_label
source: Price
id: Harga

# card_title_transaction_details
source: Transaction Details
id: Detail Transaksi

# card_title_transaction_dates
source: Transaction Dates
id: Tanggal Transaksi

# card_title_description
source: Description
id: Deskripsi

# card_item_title_customer
source: Customer
id: Pelanggan

# card_item_title_service
source: Service
id: Layanan

# card_item_title_weight
source: Weight
id: Berat

# card_item_title_amount
source: Amount
id: Total

# card_item_title_start_date
source: Start Date
id: Tanggal Mulai

# card_item_title_end_date
source: End Date
id: Tanggal Selesai

# card_item_title_created_at
source: Created At
id: Tanggal Dibuat

# card_item_title_staff_name
source: Staff Name
id: Nama Pegawai

# form_name_hint
source: Please enter your name
id: Silakan masukkan nama Anda

# form_email_hint
source: Please enter your email
id: Silakan masukkan email Anda

# form_password_hint
source: Please enter your password
id: Silakan masukkan kata sandi Anda

# form_confirm_password_hint
source: Please confirm your password
id: Silakan masukkan kata sandi Anda lagi

# form_phone_hint
source: Enter WhatsApp number with format 08xx
id: Masukkan nomor WhatsApp format 08xx

# form_price_hint
source: Please enter the price
id: Silakan masukkan harga

# form_description_hint
source: Please enter the other details
id: Silakan tambahkan keterangan tambahan

# form_name_required_message
source: Name cannot be empty
id: Nama tidak boleh kosong

# form_name_min_length_message
source: Name must be at least 3 characters
id: Nama minimal 3 karakter

# form_name_max_length_message
source: Name must be less than 100 characters
id: Nama maksimal 100 karakter

# form_email_required_message
source: Email is required
id: Email tidak boleh kosong

# form_email_invalid_message
source: Invalid email format
id: Email tidak valid

# form_password_required_message
source: Password is required
id: Kata sandi tidak boleh kosong

# form_password_min_length_message
source: Password must be at least 8 characters
id: Kata sandi minimal 8 karakter

# form_confirm_password_required_message
source: Confirm password is required
id: Konfirmasi kata sandi tidak boleh kosong

# form_confirm_password_match_message
source: Passwords do not match
id: Kata sandi tidak cocok

# form_phone_digit_length_message
source: Phone number must be 10-13 digits
id: Nomor telepon harus 10-13 digit

# form_phone_digits_only_message
source: Phone number must contain only digits
id: Nomor telepon harus terdiri dari angka saja

# form_price_required_message
source: Price can not be empty
id: Harga tidak boleh kosong

# form_price_digits_only_message
source: Price must contain only digits
id: Harga harus terdiri dari angka saja

# gender_label
source: Gender
id: Jenis Kelamin

# gender_male
source: Male
id: Laki-laki

# gender_female
source: Female
id: Perempuan

# gender_other
source: Other
id: Lainnya

# printer_settings_screen_title
source: Printer Settings
id: Pengaturan Printer

# printer_status_connected
source: Connected to: {printerName}
id: Terhubung ke: {printerName}

# printer_status_not_connected
source: Not connected to any printer
id: Tidak terhubung ke printer manapun

# printer_available_printers
source: Available Printers
id: Printer Tersedia

# printer_no_printers_found
source: No bonded printers found
id: Tidak ada printer yang terpasang

# printer_pair_instruction
source: Pair your printer in Bluetooth settings first, then refresh this list
id: Pasangkan printer Anda di pengaturan Bluetooth terlebih dahulu, kemudian segarkan daftar ini

# printer_refresh_devices
source: Refresh Devices
id: Segarkan Perangkat

# printer_test_print
source: Test Print
id: Cetak Uji

# printer_disconnect
source: Disconnect
id: Putuskan

# printer_connect
source: Connect
id: Hubungkan

# printer_connected
source: Connected
id: Terhubung

# printer_connect_success
source: Connected to {printerName}
id: Berhasil terhubung ke {printerName}

# printer_connect_failed
source: Failed to connect to {printerName}
id: Gagal terhubung ke {printerName}

# printer_disconnect_success
source: Disconnected from printer
id: Berhasil memutuskan dari printer

# printer_test_print_success
source: Test print successful
id: Cetak uji berhasil

# printer_test_print_failed
source: Failed to print test invoice
id: Gagal mencetak tanda terima uji

# printer_print_error
source: Error while printing: {error}
id: Kesalahan saat mencetak: {error}

# printer_print_invoice
source: Print Invoice
id: Cetak Nota

# printer_invoice_success
source: Invoice printed successfully
id: Nota berhasil dicetak

# printer_invoice_failed
source: Failed to print invoice
id: Gagal mencetak nota

# printer_permissions_required
source: Bluetooth permissions are required for printer functionality
id: Izin Bluetooth diperlukan untuk fungsionalitas printer

# printer_business_info
source: Business Information
id: Informasi Bisnis

# printer_business_name
source: Business Name
id: Nama Bisnis

# printer_business_name_hint
source: Enter your business name
id: Masukkan nama bisnis Anda

# printer_business_address
source: Business Address
id: Alamat Bisnis

# printer_business_address_hint
source: Enter your business address
id: Masukkan alamat bisnis Anda

# printer_business_phone
source: Business Phone
id: Telepon Bisnis

# printer_business_phone_hint
source: Enter your business phone number
id: Masukkan nomor telepon bisnis Anda

# printer_invoice_preview
source: Invoice Preview
id: Pratinjau Nota

# printer_no_transaction_data
source: No transaction data available
id: Data transaksi tidak tersedia

# printer_please_connect
source: Please connect to a printer first
id: Silakan hubungkan ke printer terlebih dahulu

# print_transaction_screen_title
source: Print Transaction Invoice
id: Cetak Nota Transaksi

# invoice_print_title
source: Invoice
id: NOTA TRANSAKSI

# invoice_print_transaction_id
source: Transaction ID
id: ID Transaksi

# invoice_print_date
source: Date
id: Tanggal

# invoice_print_customer_name
source: Customer Name
id: Pelanggan

# invoice_print_service_name
source: Service
id: Layanan

# invoice_print_weight
source: Weight
id: Berat

# invoice_print_amount
source: Amount
id: Total

# invoice_print_transaction_status
source: Transaction Status
id: Status

# invoice_print_payment_status
source: Payment Status
id: Status Pembayaran

# invoice_print_start_date
source: Start Date
id: Tanggal Mulai

# invoice_print_end_date
source: End Date
id: Tanggal Selesai

# invoice_print_staff_name
source: Staff Name
id: Pegawai

# invoice_print_invoices
source: Invoices
id: Catatan

# invoice_print_thank_you
source: Thank you for choosing {businessName}!
id: Terima kasih telah mempercayakan kami!

# button_submit
source: Submit
id: Kirim

# button_add
source: Add
id: Tambah

# button_confirm
source: Confirm
id: Konfirmasi

# button_cancel
source: Cancel
id: Batal

# button_edit
source: Edit
id: Ubah

# button_save
source: Save
id: Simpan

# button_delete
source: Delete
id: Hapus

# button_hard_delete
source: Delete Permanently
id: Hapus Permanen

# button_deactivate
source: Deactivate
id: Nonaktifkan

# button_login
source: Login
id: Masuk

# button_register
source: Register
id: Daftar

# button_logout
source: Logout
id: Keluar

# button_refresh
source: Refresh
id: Segarkan

# button_clear
source: Clear
id: Bersihkan

# button_change
source: Change
id: Ubah

# button_print
source: Print
id: Cetak

# button_connect
source: Connect
id: Hubungkan

# button_manage_staff
source: Manage Staff
id: Kelola Pegawai

# button_manage_customer
source: Manage Customer
id: Kelola Pelanggan

# button_manage_transaction
source: Manage Transaction
id: Kelola Transaksi

# button_manage_service
source: Manage Service
id: Kelola Layanan
